// coding: cp866
//----------------------------------------------------------------------------
//
#define MAXSOCK              10        // макс кол-во слушаемых сокетов
#define LENFLD              100        // макс длинна строкового поля

//----------------------------------------------------------------------------
ex  uc  SRVIP[MWS+1][LENFLD];          // адреса IP на которые будут делаться запросы
ex  ui  SRVPORT[MWS+1];                // номера портов для запросов
//----------------------------------------------------------------------------
ex  _i  TCP_init (void);
ex  _i  TCP_close(void);
ex  _i  TCP_ExitSRV;                   // флаг выхода из подпрограмм
//----------------------------------------------------------------------------
